app/controllers/comments_controller.rb

  def destroy
    @post = Post.find(params[:post_id])
    @post.comments.destroy(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "78"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]