app/controllers/posts_controller.rb

INSERT INTO "posts" ("author", "category", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", ""], ["category", ""], ["content", ""], ["created_at", Fri, 21 Sep 2012 00:42:02 UTC +00:00], ["title", ""], ["updated_at", Fri, 21 Sep 2012 00:42:02 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "53"]]
UPDATE "posts" SET "content" = 'aa', "updated_at" = '2012-09-21 01:52:36.954558' WHERE "posts"."id" = 53
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
   Post.destroy(params[:id])